# connect-shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_deadletter_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-f433fbbc-d2f7-450c-ad86-a01574dc85c9]
module.common_resources.module.kafka_retry_topic[0].upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-ee83340b-0326-4339-b846-0e14a5729d88]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-10102202-90fd-4f42-978f-2f769e095b90]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=d8a7046f-2604-4b33-94b0-0ffbf472b6c9:connect]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=d8a7046f-2604-4b33-94b0-0ffbf472b6c9:connect_database_migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "connect"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "connect_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "d8a7046f-2604-4b33-94b0-0ffbf472b6c9:connect_database_migration"
        name       = "connect_database_migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "4d6ebea7-3054-47be-9efe-1b41afd8f8a2" -> "f2fea43b-ac83-4ea7-9f4d-c7998948c433"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*